import math

day = ["一", "二", "三", "四", "五", "六", "日"]
time_slots = [
    [8, 15, 9, 0],
    [9, 10, 9, 55],
    [10, 15, 11, 0],
    [11, 10, 11, 55],
    [13, 50, 14, 35],
    [14, 45, 15, 30],
    [15, 40, 16, 25],
    [16, 45, 17, 30],
    [17, 40, 18, 25],
    [19, 20, 20, 5],
    [20, 15, 21, 00],
    [21, 10, 21, 55],
]

i = 0
for i in range(7 * 12):
    day_str = f"\"星期{day[math.floor(i / 12)]}\""
    slot_list = ', '.join(str(x) for x in time_slots[i % 12])
    print(f"({i + 1}, {day_str}, {slot_list}),")
